// GENERATED FILE - DO NOT MODIFY BY HAND
// ignore_for_file: prefer_const_constructors


final currenciesUR = <Map<String,dynamic>>[
 {
 "code":"AED",
  "name": "متحدہ عرب اماراتی درہم",
 },
 {
 "code":"AFN",
  "name": "افغان افغانی",
 },
 {
 "code":"ALL",
  "name": "البانی لیک",
 },
 {
 "code":"AMD",
  "name": "آرمینیائی ڈرام",
 },
 {
 "code":"AOA",
  "name": "انگولائی کوانزا",
 },
 {
 "code":"ARS",
  "name": "ارجنٹائن پیسو",
 },
 {
 "code":"AUD",
  "name": "آسٹریلوی ڈالر",
 },
 {
 "code":"AWG",
  "name": "اروبن فلورن",
 },
 {
 "code":"AZN",
  "name": "آذربائیجانی منات",
 },
 {
 "code":"BAM",
  "name": "بوسنیا و ہرزیگووینا قابل منتقلی نشان",
 },
 {
 "code":"BBD",
  "name": "بارباڈوس ڈالر",
 },
 {
 "code":"BDT",
  "name": "بنگلہ دیشی ٹکا",
 },
 {
 "code":"BGN",
  "name": "بلغاری لیو",
 },
 {
 "code":"BHD",
  "name": "بحرینی دینار",
 },
 {
 "code":"BIF",
  "name": "برونڈی فرانک",
 },
 {
 "code":"BMD",
  "name": "برموڈا ڈالر",
 },
 {
 "code":"BND",
  "name": "برونائی ڈالر",
 },
 {
 "code":"BOB",
  "name": "بولیوین بولیویانو",
 },
 {
 "code":"BOV",
  "name": "بولیوین Mvdol (فنڈز کوڈ)",
 },
 {
 "code":"BRL",
  "name": "برازیلی ریئل",
 },
 {
 "code":"BSD",
  "name": "بہاماس ڈالر",
 },
 {
 "code":"BTN",
  "name": "بھوٹانی نگلترم",
 },
 {
 "code":"BWP",
  "name": "بوٹسوانا پولا",
 },
 {
 "code":"BYN",
  "name": "بیلاروسی روبل",
 },
 {
 "code":"BZD",
  "name": "بیلیز ڈالر",
 },
 {
 "code":"CAD",
  "name": "کینیڈین ڈالر",
 },
 {
 "code":"CDF",
  "name": "کانگولیس فرانک",
 },
 {
 "code":"CHF",
  "name": "سوئس فرانک",
 },
 {
 "code":"CLF",
  "name": "یونیداد ڈی فومینٹو (فنڈز کوڈ)",
 },
 {
 "code":"CLP",
  "name": "چلی پیسو",
 },
 {
 "code":"CNY",
  "name": "رینمنبی",
 },
 {
 "code":"COP",
  "name": "کولمبیائی پیسو",
 },
 {
 "code":"COU",
  "name": "یونیداد ڈی ویلور ریئل (UVR) (فنڈز کوڈ)",
 },
 {
 "code":"CRC",
  "name": "کوسٹا ریکن کولون",
 },
 {
 "code":"CUP",
  "name": "کیوبن پیسو",
 },
 {
 "code":"CVE",
  "name": "کیپ ورڈین ایسکیوڈو",
 },
 {
 "code":"CZK",
  "name": "چیک کرونا",
 },
 {
 "code":"DJF",
  "name": "جبوتی فرانک",
 },
 {
 "code":"DKK",
  "name": "ڈینش کرون",
 },
 {
 "code":"DOP",
  "name": "ڈومینیکن پیسو",
 },
 {
 "code":"DZD",
  "name": "الجیریائی دینار",
 },
 {
 "code":"EGP",
  "name": "مصری پاؤنڈ",
 },
 {
 "code":"ERN",
  "name": "اریٹریائی ناکفا",
 },
 {
 "code":"ETB",
  "name": "ایتھوپیائی بر",
 },
 {
 "code":"EUR",
  "name": "یورو",
 },
 {
 "code":"FJD",
  "name": "فجی ڈالر",
 },
 {
 "code":"FKP",
  "name": "فاکلینڈ جزائر پاؤنڈ",
 },
 {
 "code":"GBP",
  "name": "پاؤنڈ سٹرلنگ",
 },
 {
 "code":"GEL",
  "name": "جارجیائی لاری",
 },
 {
 "code":"GHS",
  "name": "گھانا سیڈی",
 },
 {
 "code":"GIP",
  "name": "جبرالٹر پاؤنڈ",
 },
 {
 "code":"GMD",
  "name": "گیمبیئن دالاسی",
 },
 {
 "code":"GNF",
  "name": "گنی فرانک",
 },
 {
 "code":"GTQ",
  "name": "گواٹے مالا کوئٹزل",
 },
 {
 "code":"GYD",
  "name": "گیانا ڈالر",
 },
 {
 "code":"HKD",
  "name": "ہانگ کانگ ڈالر",
 },
 {
 "code":"HNL",
  "name": "ہونڈوراس لیمپیرا",
 },
 {
 "code":"HTG",
  "name": "ہیتی گورڈ",
 },
 {
 "code":"HUF",
  "name": "ہنگری فورنٹ",
 },
 {
 "code":"IDR",
  "name": "انڈونیشیائی روپیہ",
 },
 {
 "code":"ILS",
  "name": "اسرائیلی نیا شیکل",
 },
 {
 "code":"INR",
  "name": "بھارتی روپیہ",
 },
 {
 "code":"IQD",
  "name": "عراقی دینار",
 },
 {
 "code":"IRR",
  "name": "ایرانی ریال",
 },
 {
 "code":"ISK",
  "name": "آئس لینڈی کرونا",
 },
 {
 "code":"JMD",
  "name": "جمیکا ڈالر",
 },
 {
 "code":"JOD",
  "name": "اردنی دینار",
 },
 {
 "code":"JPY",
  "name": "جاپانی ین",
 },
 {
 "code":"KES",
  "name": "کینیائی شلنگ",
 },
 {
 "code":"KGS",
  "name": "کرغستانی سوم",
 },
 {
 "code":"KHR",
  "name": "کمبوڈیائی ریل",
 },
 {
 "code":"KMF",
  "name": "کومورو فرانک",
 },
 {
 "code":"KPW",
  "name": "شمالی کوریائی وون",
 },
 {
 "code":"KRW",
  "name": "جنوبی کوریائی وون",
 },
 {
 "code":"KWD",
  "name": "کویتی دینار",
 },
 {
 "code":"KYD",
  "name": "کیمین جزائر ڈالر",
 },
 {
 "code":"KZT",
  "name": "قازقستانی ٹینگے",
 },
 {
 "code":"LAK",
  "name": "لاؤ کیپ",
 },
 {
 "code":"LBP",
  "name": "لبنانی پاؤنڈ",
 },
 {
 "code":"LKR",
  "name": "سری لنکن روپیہ",
 },
 {
 "code":"LRD",
  "name": "لائبیریائی ڈالر",
 },
 {
 "code":"LSL",
  "name": "لیسوتھو لوٹی",
 },
 {
 "code":"LYD",
  "name": "لیبیائی دینار",
 },
 {
 "code":"MAD",
  "name": "مراکشی درہم",
 },
 {
 "code":"MDL",
  "name": "مالڈووین لیو",
 },
 {
 "code":"MGA",
  "name": "ملاگاسی آریاری",
 },
 {
 "code":"MKD",
  "name": "مقدونیائی دینار",
 },
 {
 "code":"MMK",
  "name": "میانمار کیات",
 },
 {
 "code":"MNT",
  "name": "منگولیائی ٹوگرک",
 },
 {
 "code":"MOP",
  "name": "مکانی پٹاکا",
 },
 {
 "code":"MRU",
  "name": "موریطانیائی اوگوئیا",
 },
 {
 "code":"MUR",
  "name": "ماریشسی روپیہ",
 },
 {
 "code":"MVR",
  "name": "مالدیپ روفیا",
 },
 {
 "code":"MWK",
  "name": "ملاوی کواچا",
 },
 {
 "code":"MXN",
  "name": "میکسیکی پیسو",
 },
 {
 "code":"MXV",
  "name": "میکسیکی یونیداد ڈی انورژن (UDI) (فنڈز کوڈ)",
 },
 {
 "code":"MYR",
  "name": "ملائیشیائی رنگٹ",
 },
 {
 "code":"MZN",
  "name": "موزمبیق میٹیکل",
 },
 {
 "code":"NAD",
  "name": "نمیبیائی ڈالر",
 },
 {
 "code":"NGN",
  "name": "نائجیریائی نائرا",
 },
 {
 "code":"NIO",
  "name": "نکاراگوا قرطبہ",
 },
 {
 "code":"NOK",
  "name": "نارویجن کرون",
 },
 {
 "code":"NPR",
  "name": "نیپالی روپیہ",
 },
 {
 "code":"NZD",
  "name": "نیوزی لینڈ ڈالر",
 },
 {
 "code":"OMR",
  "name": "عمانی ریال",
 },
 {
 "code":"PAB",
  "name": "پانامہ بالبوآ",
 },
 {
 "code":"PEN",
  "name": "پیرو سول",
 },
 {
 "code":"PGK",
  "name": "پاپوا نیو گنی کینا",
 },
 {
 "code":"PHP",
  "name": "فلپائنی پیسو",
 },
 {
 "code":"PKR",
  "name": "پاکستانی روپیہ",
 },
 {
 "code":"PLN",
  "name": "پولش زلوٹی",
 },
 {
 "code":"PYG",
  "name": "پیراگوئے گوارانی",
 },
 {
 "code":"QAR",
  "name": "قطری ریال",
 },
 {
 "code":"RON",
  "name": "رومانی لیو",
 },
 {
 "code":"RSD",
  "name": "سربیائی دینار",
 },
 {
 "code":"RUB",
  "name": "روسی روبل",
 },
 {
 "code":"RWF",
  "name": "روانڈا فرانک",
 },
 {
 "code":"SAR",
  "name": "سعودی ریال",
 },
 {
 "code":"SBD",
  "name": "سولومن جزائر ڈالر",
 },
 {
 "code":"SCR",
  "name": "سیشلز روپیہ",
 },
 {
 "code":"SDG",
  "name": "سوڈانی پاؤنڈ",
 },
 {
 "code":"SEK",
  "name": "سویڈش کرونا",
 },
 {
 "code":"SGD",
  "name": "سنگاپور ڈالر",
 },
 {
 "code":"SHP",
  "name": "سینٹ ہیلینا پاؤنڈ",
 },
 {
 "code":"SLE",
  "name": "سیرا لیونی لیون",
 },
 {
 "code":"SOS",
  "name": "صومالی شلنگ",
 },
 {
 "code":"SRD",
  "name": "سورینام ڈالر",
 },
 {
 "code":"SSP",
  "name": "جنوبی سوڈانی پاؤنڈ",
 },
 {
 "code":"STN",
  "name": "ساؤ ٹومے و پرنسپے ڈوبرا",
 },
 {
 "code":"SVC",
  "name": "ایل سلواڈور کولون",
 },
 {
 "code":"SYP",
  "name": "شامی پاؤنڈ",
 },
 {
 "code":"SZL",
  "name": "سوازی لیلانگینی",
 },
 {
 "code":"THB",
  "name": "تھائی بھات",
 },
 {
 "code":"TJS",
  "name": "تاجکستانی سومونی",
 },
 {
 "code":"TMT",
  "name": "ترکمانستان منات",
 },
 {
 "code":"TND",
  "name": "تونسی دینار",
 },
 {
 "code":"TOP",
  "name": "ٹونگن پاآنگا",
 },
 {
 "code":"TRY",
  "name": "ترک لیرا",
 },
 {
 "code":"TTD",
  "name": "ٹرینیڈاڈ و ٹوباگو ڈالر",
 },
 {
 "code":"TWD",
  "name": "نیا تائیوان ڈالر",
 },
 {
 "code":"TZS",
  "name": "تنزانیائی شلنگ",
 },
 {
 "code":"UAH",
  "name": "یوکرینی ہریونیا",
 },
 {
 "code":"UGX",
  "name": "یوگنڈا شلنگ",
 },
 {
 "code":"USD",
  "name": "امریکی ڈالر",
 },
 {
 "code":"USN",
  "name": "امریکی ڈالر (اگلا دن)",
 },
 {
 "code":"UYI",
  "name": "یوراگوئے پیسو این یونیدادیس انڈیکساداس (URUIURUI) (فنڈز کوڈ)",
 },
 {
 "code":"UYU",
  "name": "یوراگوئے پیسو",
 },
 {
 "code":"UYW",
  "name": "یونیداد پریویزنل",
 },
 {
 "code":"UZS",
  "name": "ازبکستانی سوم",
 },
 {
 "code":"VES",
  "name": "وینزویلا بولیور سوبیرانو",
 },
 {
 "code":"VND",
  "name": "ویتنامی ڈونگ",
 },
 {
 "code":"VUV",
  "name": "وانواتو واتو",
 },
 {
 "code":"WST",
  "name": "ساموآن ٹالا",
 },
 {
 "code":"XAF",
  "name": "وسطی افریقی CFA فرانک",
 },
 {
 "code":"XAG",
  "name": "چاندی (ایک ٹرائے اونس)",
 },
 {
 "code":"XAU",
  "name": "سونا (ایک ٹرائے اونس)",
 },
 {
 "code":"XBA",
  "name": "یورپی مرکب یونٹ (EURCO) (بانڈ مارکیٹ یونٹ)",
 },
 {
 "code":"XBB",
  "name": "یورپی مالیاتی یونٹ (E.M.U.-6) (بانڈ مارکیٹ یونٹ)",
 },
 {
 "code":"XBC",
  "name": "یورپی یونٹ آف اکاؤنٹ 9 (E.U.A.-9) (بانڈ مارکیٹ یونٹ)",
 },
 {
 "code":"XBD",
  "name": "یورپی یونٹ آف اکاؤنٹ 17 (E.U.A.-17) (بانڈ مارکیT یونٹ)",
 },
 {
 "code":"XCD",
  "name": "مشرقی کیریبین ڈالر",
 },
 {
 "code":"XDR",
  "name": "خصوصی ڈرائنگ حقوق",
 },
 {
 "code":"XOF",
  "name": "مغربی افریقی CFA فرانک",
 },
 {
 "code":"XPD",
  "name": "پیلیڈیم (ایک ٹرائے اونس)",
 },
 {
 "code":"XPF",
  "name": "CFP فرانک",
 },
 {
 "code":"XPT",
  "name": "پلاٹینم (ایک ٹرائے اونس)",
 },
 {
 "code":"XSU",
  "name": "سوکری",
 },
 {
 "code":"XUA",
  "name": "ADB یونٹ آف اکاؤنٹ",
 },
 {
 "code":"YER",
  "name": "یمنی ریال",
 },
 {
 "code":"ZAR",
  "name": "جنوبی افریقی رانڈ",
 },
 {
 "code":"ZMW",
  "name": "زیمبیائی کواچا",
 },
 {
 "code":"ZWL",
  "name": "زمبابوے ڈالر",
 },
];
