// GENERATED FILE - DO NOT MODIFY BY HAND
// ignore_for_file: prefer_const_constructors


final currenciesRU = <Map<String,dynamic>>[
 {
 "code":"AED",
  "name": "Дирхам ОАЭ",
 },
 {
 "code":"AFN",
  "name": "Афганский афгани",
 },
 {
 "code":"ALL",
  "name": "Албанский лек",
 },
 {
 "code":"AMD",
  "name": "Армянский драм",
 },
 {
 "code":"AOA",
  "name": "Ангольская кванза",
 },
 {
 "code":"ARS",
  "name": "Аргентинское песо",
 },
 {
 "code":"AUD",
  "name": "Австралийский доллар",
 },
 {
 "code":"AWG",
  "name": "Арубанский флорин",
 },
 {
 "code":"AZN",
  "name": "Азербайджанский манат",
 },
 {
 "code":"BAM",
  "name": "Конвертируемая марка Боснии и Герцеговины",
 },
 {
 "code":"BBD",
  "name": "Барбадосский доллар",
 },
 {
 "code":"BDT",
  "name": "Бангладешская така",
 },
 {
 "code":"BGN",
  "name": "Болгарский лев",
 },
 {
 "code":"BHD",
  "name": "Бахрейнский динар",
 },
 {
 "code":"BIF",
  "name": "Бурундийский франк",
 },
 {
 "code":"BMD",
  "name": "Бермудский доллар",
 },
 {
 "code":"BND",
  "name": "Брунейский доллар",
 },
 {
 "code":"BOB",
  "name": "Боливиано",
 },
 {
 "code":"BOV",
  "name": "Боливийский мвдол (код фонда)",
 },
 {
 "code":"BRL",
  "name": "Бразильский реал",
 },
 {
 "code":"BSD",
  "name": "Багамский доллар",
 },
 {
 "code":"BTN",
  "name": "Бутанский нгултрум",
 },
 {
 "code":"BWP",
  "name": "Ботсванская пула",
 },
 {
 "code":"BYN",
  "name": "Белорусский рубль",
 },
 {
 "code":"BZD",
  "name": "Белизский долlar",
 },
 {
 "code":"CAD",
  "name": "Канадский доллар",
 },
 {
 "code":"CDF",
  "name": "Конголезский франк",
 },
 {
 "code":"CHF",
  "name": "Швейцарский франк",
 },
 {
 "code":"CLF",
  "name": "Унидад де Фоменто (код фонда)",
 },
 {
 "code":"CLP",
  "name": "Чилийское песо",
 },
 {
 "code":"CNY",
  "name": "Юань",
 },
 {
 "code":"COP",
  "name": "Колумбийское песо",
 },
 {
 "code":"COU",
  "name": "Унидад де Валор Реал (UVR) (код фонда)",
 },
 {
 "code":"CRC",
  "name": "Коста-риканский колон",
 },
 {
 "code":"CUP",
  "name": "Кубинское песо",
 },
 {
 "code":"CVE",
  "name": "Эскудо Кабо-Верде",
 },
 {
 "code":"CZK",
  "name": "Чешская крона",
 },
 {
 "code":"DJF",
  "name": "Джибутийский франк",
 },
 {
 "code":"DKK",
  "name": "Датская крона",
 },
 {
 "code":"DOP",
  "name": "Доминиканское песо",
 },
 {
 "code":"DZD",
  "name": "Алжирский динар",
 },
 {
 "code":"EGP",
  "name": "Египетский фунт",
 },
 {
 "code":"ERN",
  "name": "Эритрейская накфа",
 },
 {
 "code":"ETB",
  "name": "Эфиопский быр",
 },
 {
 "code":"EUR",
  "name": "Евро",
 },
 {
 "code":"FJD",
  "name": "Фиджийский доллар",
 },
 {
 "code":"FKP",
  "name": "Фунт Фолклендских островов",
 },
 {
 "code":"GBP",
  "name": "Фунт стерлингов",
 },
 {
 "code":"GEL",
  "name": "Грузинский лари",
 },
 {
 "code":"GHS",
  "name": "Ганский седи",
 },
 {
 "code":"GIP",
  "name": "Гибралтарский фунт",
 },
 {
 "code":"GMD",
  "name": "Гамбийский даласи",
 },
 {
 "code":"GNF",
  "name": "Гвинейский франк",
 },
 {
 "code":"GTQ",
  "name": "Гватемальский кетсаль",
 },
 {
 "code":"GYD",
  "name": "Гайанский доллар",
 },
 {
 "code":"HKD",
  "name": "Гонконгский доллар",
 },
 {
 "code":"HNL",
  "name": "Гондурасская лемпира",
 },
 {
 "code":"HTG",
  "name": "Гаитянский гурд",
 },
 {
 "code":"HUF",
  "name": "Венгерский форинт",
 },
 {
 "code":"IDR",
  "name": "Индонезийская рупия",
 },
 {
 "code":"ILS",
  "name": "Новый израильский шекель",
 },
 {
 "code":"INR",
  "name": "Индийская рупия",
 },
 {
 "code":"IQD",
  "name": "Иракский динар",
 },
 {
 "code":"IRR",
  "name": "Иранский риал",
 },
 {
 "code":"ISK",
  "name": "Исландская крона",
 },
 {
 "code":"JMD",
  "name": "Ямайский доллар",
 },
 {
 "code":"JOD",
  "name": "Иорданский динар",
 },
 {
 "code":"JPY",
  "name": "Японская иена",
 },
 {
 "code":"KES",
  "name": "Кенийский шиллинг",
 },
 {
 "code":"KGS",
  "name": "Киргизский сом",
 },
 {
 "code":"KHR",
  "name": "Камбоджийский риель",
 },
 {
 "code":"KMF",
  "name": "Коморский франк",
 },
 {
 "code":"KPW",
  "name": "Северокорейская вона",
 },
 {
 "code":"KRW",
  "name": "Южнокорейская вона",
 },
 {
 "code":"KWD",
  "name": "Кувейтский динар",
 },
 {
 "code":"KYD",
  "name": "Доллар Каймановых островов",
 },
 {
 "code":"KZT",
  "name": "Казахстанский тенге",
 },
 {
 "code":"LAK",
  "name": "Лаосский кип",
 },
 {
 "code":"LBP",
  "name": "Ливанский фунт",
 },
 {
 "code":"LKR",
  "name": "Шри-ланкийская рупия",
 },
 {
 "code":"LRD",
  "name": "Либерийский доллар",
 },
 {
 "code":"LSL",
  "name": "Лоти Лесото",
 },
 {
 "code":"LYD",
  "name": "Ливийский динар",
 },
 {
 "code":"MAD",
  "name": "Марокканский дирхам",
 },
 {
 "code":"MDL",
  "name": "Молдавский лей",
 },
 {
 "code":"MGA",
  "name": "Малагасийский ариари",
 },
 {
 "code":"MKD",
  "name": "Македонский денар",
 },
 {
 "code":"MMK",
  "name": "Мьянманский кьят",
 },
 {
 "code":"MNT",
  "name": "Монгольский тугрик",
 },
 {
 "code":"MOP",
  "name": "Патака Макао",
 },
 {
 "code":"MRU",
  "name": "Мавританская угия",
 },
 {
 "code":"MUR",
  "name": "Маврикийская рупия",
 },
 {
 "code":"MVR",
  "name": "Мальдивская руфия",
 },
 {
 "code":"MWK",
  "name": "Малавийская квача",
 },
 {
 "code":"MXN",
  "name": "Мексиканское песо",
 },
 {
 "code":"MXV",
  "name": "Мексиканский унидад де инверсион (UDI) (код фонда)",
 },
 {
 "code":"MYR",
  "name": "Малайзийский ринггит",
 },
 {
 "code":"MZN",
  "name": "Мозамбикский метикал",
 },
 {
 "code":"NAD",
  "name": "Намибийский доллар",
 },
 {
 "code":"NGN",
  "name": "Нигерийская найра",
 },
 {
 "code":"NIO",
  "name": "Никарагуанская кордоба",
 },
 {
 "code":"NOK",
  "name": "Норвежская крона",
 },
 {
 "code":"NPR",
  "name": "Непальская рупия",
 },
 {
 "code":"NZD",
  "name": "Новозеландский доллар",
 },
 {
 "code":"OMR",
  "name": "Оманский риал",
 },
 {
 "code":"PAB",
  "name": "Панамский бальбоа",
 },
 {
 "code":"PEN",
  "name": "Перуанский соль",
 },
 {
 "code":"PGK",
  "name": "Кина Папуа - Новой Гвинеи",
 },
 {
 "code":"PHP",
  "name": "Филиппинское песо",
 },
 {
 "code":"PKR",
  "name": "Пакистанская рупия",
 },
 {
 "code":"PLN",
  "name": "Польский злотый",
 },
 {
 "code":"PYG",
  "name": "Парагвайский гуарани",
 },
 {
 "code":"QAR",
  "name": "Катарский риал",
 },
 {
 "code":"RON",
  "name": "Румынский лей",
 },
 {
 "code":"RSD",
  "name": "Сербский динар",
 },
 {
 "code":"RUB",
  "name": "Российский рубль",
 },
 {
 "code":"RWF",
  "name": "Руандийский франк",
 },
 {
 "code":"SAR",
  "name": "Саудовский риял",
 },
 {
 "code":"SBD",
  "name": "Доллар Соломоновых островов",
 },
 {
 "code":"SCR",
  "name": "Сейшельская рупия",
 },
 {
 "code":"SDG",
  "name": "Суданский фунт",
 },
 {
 "code":"SEK",
  "name": "Шведская крона",
 },
 {
 "code":"SGD",
  "name": "Сингапурский доллар",
 },
 {
 "code":"SHP",
  "name": "Фунт острова Святой Елены",
 },
 {
 "code":"SLE",
  "name": "Сьерра-леонский леоне",
 },
 {
 "code":"SOS",
  "name": "Сомалийский шиллинг",
 },
 {
 "code":"SRD",
  "name": "Суринамский доллар",
 },
 {
 "code":"SSP",
  "name": "Южносуданский фунт",
 },
 {
 "code":"STN",
  "name": "Добра Сан-Томе и Принсипи",
 },
 {
 "code":"SVC",
  "name": "Сальвадорский колон",
 },
 {
 "code":"SYP",
  "name": "Сирийский фунт",
 },
 {
 "code":"SZL",
  "name": "Свазилендский лилангени",
 },
 {
 "code":"THB",
  "name": "Тайский бат",
 },
 {
 "code":"TJS",
  "name": "Таджикский сомони",
 },
 {
 "code":"TMT",
  "name": "Туркменский манат",
 },
 {
 "code":"TND",
  "name": "Тунисский динар",
 },
 {
 "code":"TOP",
  "name": "Тонганская паанга",
 },
 {
 "code":"TRY",
  "name": "Турецкая лира",
 },
 {
 "code":"TTD",
  "name": "Доллар Тринидада и Тобаго",
 },
 {
 "code":"TWD",
  "name": "Новый тайваньский доллар",
 },
 {
 "code":"TZS",
  "name": "Танзанийский шиллинг",
 },
 {
 "code":"UAH",
  "name": "Украинская гривна",
 },
 {
 "code":"UGX",
  "name": "Угандийский шиллинг",
 },
 {
 "code":"USD",
  "name": "Доллар США",
 },
 {
 "code":"USN",
  "name": "Доллар США (следующий день)",
 },
 {
 "code":"UYI",
  "name": "Уругвайское песо в индексированных единицах (URUIURUI) (код фонда)",
 },
 {
 "code":"UYU",
  "name": "Уругвайское песо",
 },
 {
 "code":"UYW",
  "name": "Unidad previsional",
 },
 {
 "code":"UZS",
  "name": "Узбекский сум",
 },
 {
 "code":"VES",
  "name": "Венесуэльский боливар soberano",
 },
 {
 "code":"VND",
  "name": "Вьетнамский донг",
 },
 {
 "code":"VUV",
  "name": "Вануатский вату",
 },
 {
 "code":"WST",
  "name": "Самоанская тала",
 },
 {
 "code":"XAF",
  "name": "Центральноафриканский франк КФА",
 },
 {
 "code":"XAG",
  "name": "Серебро (одна тройская унция)",
 },
 {
 "code":"XAU",
  "name": "Золото (одна тройская унция)",
 },
 {
 "code":"XBA",
  "name": "Европейская составная единица (EURCO) (единица рынка облигаций)",
 },
 {
 "code":"XBB",
  "name": "Европейская валютная единица (E.M.U.-6) (единица рынка облигаций)",
 },
 {
 "code":"XBC",
  "name": "Европейская расчетная единица 9 (E.U.A.-9) (единица рынка облигаций)",
 },
 {
 "code":"XBD",
  "name": "Европейская расчетная единица 17 (E.U.A.-17) (единица рынка облигаций)",
 },
 {
 "code":"XCD",
  "name": "Восточно-карибский доллар",
 },
 {
 "code":"XDR",
  "name": "Специальные права заимствования",
 },
 {
 "code":"XOF",
  "name": "Западноафриканский франк КФА",
 },
 {
 "code":"XPD",
  "name": "Палладий (одна тройская унция)",
 },
 {
 "code":"XPF",
  "name": "Франк КФП",
 },
 {
 "code":"XPT",
  "name": "Платина (одна тройская унция)",
 },
 {
 "code":"XSU",
  "name": "Сукре",
 },
 {
 "code":"XUA",
  "name": "Расчетная единица АБР",
 },
 {
 "code":"YER",
  "name": "Йеменский риал",
 },
 {
 "code":"ZAR",
  "name": "Южноафриканский рэнд",
 },
 {
 "code":"ZMW",
  "name": "Замбийская квача",
 },
 {
 "code":"ZWL",
  "name": "Доллар Зимбабве",
 },
];
