// GENERATED FILE - DO NOT MODIFY BY HAND
// ignore_for_file: prefer_const_constructors


final currenciesHI = <Map<String,dynamic>>[
 {
 "code":"AED",
  "name": "संयुक्त अरब अमीरात दिरहम",
 },
 {
 "code":"AFN",
  "name": "अफ़गान अफ़गानी",
 },
 {
 "code":"ALL",
  "name": "अल्बानियाई लेक",
 },
 {
 "code":"AMD",
  "name": "आर्मीनियाई ड्राम",
 },
 {
 "code":"AOA",
  "name": "अंगोलन क्वान्ज़ा",
 },
 {
 "code":"ARS",
  "name": "अर्जενਟੀਨੀ पेसो",
 },
 {
 "code":"AUD",
  "name": "ऑस्ट्रेलियाई डॉलर",
 },
 {
 "code":"AWG",
  "name": "अरूबन फ्लोरिन",
 },
 {
 "code":"AZN",
  "name": "अज़रबैजानी मनात",
 },
 {
 "code":"BAM",
  "name": "बोस्निया और हर्ज़ेगोविना परिवर्तनीय मार्क",
 },
 {
 "code":"BBD",
  "name": "बारबाडोस डॉलर",
 },
 {
 "code":"BDT",
  "name": "बांग्लादेशी टका",
 },
 {
 "code":"BGN",
  "name": "बल्गेरियाई लेव",
 },
 {
 "code":"BHD",
  "name": "बहरीनी दीनार",
 },
 {
 "code":"BIF",
  "name": "बुरुंडियन फ्रैंक",
 },
 {
 "code":"BMD",
  "name": "बरमूडियन डॉलर",
 },
 {
 "code":"BND",
  "name": "ब्रुनेई डॉलर",
 },
 {
 "code":"BOB",
  "name": "बोलिवियानो",
 },
 {
 "code":"BOV",
  "name": "बोलिवियन Mvdol (फंड कोड)",
 },
 {
 "code":"BRL",
  "name": "ब्राज़ीलियाई रियल",
 },
 {
 "code":"BSD",
  "name": "बहामियन डॉलर",
 },
 {
 "code":"BTN",
  "name": "भूटानी नगुल्टम",
 },
 {
 "code":"BWP",
  "name": "बोत्सवाना पुला",
 },
 {
 "code":"BYN",
  "name": "बेलारूसी रूबल",
 },
 {
 "code":"BZD",
  "name": "बेलीज़ डॉलर",
 },
 {
 "code":"CAD",
  "name": "कनाडाई डॉलर",
 },
 {
 "code":"CDF",
  "name": "कांगोली फ्रैंक",
 },
 {
 "code":"CHF",
  "name": "स्विस फ्रैंक",
 },
 {
 "code":"CLF",
  "name": "यूनिडाड डी फोमेंटो (फंड कोड)",
 },
 {
 "code":"CLP",
  "name": "चिली पेसो",
 },
 {
 "code":"CNY",
  "name": "रेनमिन्बी",
 },
 {
 "code":"COP",
  "name": "कोलम्बियाई पेसो",
 },
 {
 "code":"COU",
  "name": "यूनिडाड डी वेलोर रियल (UVR) (फंड कोड)",
 },
 {
 "code":"CRC",
  "name": "कोस्टा रिकन कोलन",
 },
 {
 "code":"CUP",
  "name": "क्यूबाई पेसो",
 },
 {
 "code":"CVE",
  "name": "केप वर्डीन एस्कूडो",
 },
 {
 "code":"CZK",
  "name": "चेक कोरुना",
 },
 {
 "code":"DJF",
  "name": "जिबूतीयन फ्रैंक",
 },
 {
 "code":"DKK",
  "name": "डैनिश क्रोन",
 },
 {
 "code":"DOP",
  "name": "डोमिनिकन पेसो",
 },
 {
 "code":"DZD",
  "name": "अल्जीरियाई दीनार",
 },
 {
 "code":"EGP",
  "name": "मिस्री पाउंड",
 },
 {
 "code":"ERN",
  "name": "इरिट्रियाई नाक्फा",
 },
 {
 "code":"ETB",
  "name": "इथियोपियाई बिर",
 },
 {
 "code":"EUR",
  "name": "यूरो",
 },
 {
 "code":"FJD",
  "name": "फ़िजी डॉलर",
 },
 {
 "code":"FKP",
  "name": "फ़ॉकलैंड द्वीप पाउंड",
 },
 {
 "code":"GBP",
  "name": "पाउंड स्टर्लिंग",
 },
 {
 "code":"GEL",
  "name": "जॉर्जियाई लारी",
 },
 {
 "code":"GHS",
  "name": "घानियन सेडी",
 },
 {
 "code":"GIP",
  "name": "जिब्राल्टर पाउंड",
 },
 {
 "code":"GMD",
  "name": "गैम्बियन डालसी",
 },
 {
 "code":"GNF",
  "name": "गिनी फ्रैंक",
 },
 {
 "code":"GTQ",
  "name": "ग्वाटेमालाइन क्वेटज़ल",
 },
 {
 "code":"GYD",
  "name": "गुयानीज़ डॉलर",
 },
 {
 "code":"HKD",
  "name": "हांगकांग डॉलर",
 },
 {
 "code":"HNL",
  "name": "होंडुरन लेम्पिरा",
 },
 {
 "code":"HTG",
  "name": "हाईटियन गर्ड",
 },
 {
 "code":"HUF",
  "name": "हंगेरियन फ़ोरिंट",
 },
 {
 "code":"IDR",
  "name": "इंडोनेशियाई रुपिया",
 },
 {
 "code":"ILS",
  "name": "इज़राइली नई शेकेल",
 },
 {
 "code":"INR",
  "name": "भारतीय रुपया",
 },
 {
 "code":"IQD",
  "name": "इराकी दीनार",
 },
 {
 "code":"IRR",
  "name": "ईरानी रियाल",
 },
 {
 "code":"ISK",
  "name": "आइसलैंडिक क्रोना",
 },
 {
 "code":"JMD",
  "name": "जमैकन डॉलर",
 },
 {
 "code":"JOD",
  "name": "जॉर्डनियन दीनार",
 },
 {
 "code":"JPY",
  "name": "जापानी येन",
 },
 {
 "code":"KES",
  "name": "केन्याई शिलिंग",
 },
 {
 "code":"KGS",
  "name": "किर्गिज़स्तानी सोम",
 },
 {
 "code":"KHR",
  "name": "कंबोडियन रिएल",
 },
 {
 "code":"KMF",
  "name": "कोमोरो फ्रैंक",
 },
 {
 "code":"KPW",
  "name": "उत्तर कोरियाई वॉन",
 },
 {
 "code":"KRW",
  "name": "दक्षिण कोरियाई वॉन",
 },
 {
 "code":"KWD",
  "name": "कुवैती दीनार",
 },
 {
 "code":"KYD",
  "name": "केमैन द्वीप डॉलर",
 },
 {
 "code":"KZT",
  "name": "कज़ाखस्तानी तेंगे",
 },
 {
 "code":"LAK",
  "name": "लाओ किप",
 },
 {
 "code":"LBP",
  "name": "लेबनानी पाउंड",
 },
 {
 "code":"LKR",
  "name": "श्रीलंकाई रुपया",
 },
 {
 "code":"LRD",
  "name": "लाइबेरियाई डॉलर",
 },
 {
 "code":"LSL",
  "name": "लेसोथो लोटी",
 },
 {
 "code":"LYD",
  "name": "लीबियाई दीनार",
 },
 {
 "code":"MAD",
  "name": "मोरक्कन दिरहम",
 },
 {
 "code":"MDL",
  "name": "मोल्दोवन ल्यू",
 },
 {
 "code":"MGA",
  "name": "मालागासी एरियरी",
 },
 {
 "code":"MKD",
  "name": "मेसीडोनियन देनार",
 },
 {
 "code":"MMK",
  "name": "म्यांमार क्यात",
 },
 {
 "code":"MNT",
  "name": "मंगोलियाई टोगरोग",
 },
 {
 "code":"MOP",
  "name": "मकानेज़ पटाका",
 },
 {
 "code":"MRU",
  "name": "मॉरिटानियन ओगुइया",
 },
 {
 "code":"MUR",
  "name": "मॉरीशियन रुपया",
 },
 {
 "code":"MVR",
  "name": "मालदीवियन रूफिया",
 },
 {
 "code":"MWK",
  "name": "मलावी क्वाचा",
 },
 {
 "code":"MXN",
  "name": "मैक्सिकन पेसो",
 },
 {
 "code":"MXV",
  "name": "मैक्सिकन यूनिडाड डी इन्वर्सन (UDI) (फंड कोड)",
 },
 {
 "code":"MYR",
  "name": "मलेशियाई रिंगित",
 },
 {
 "code":"MZN",
  "name": "मोज़ाम्बिक मेटिकल",
 },
 {
 "code":"NAD",
  "name": "नामीबियाई डॉलर",
 },
 {
 "code":"NGN",
  "name": "नाइजीरियाई नायरा",
 },
 {
 "code":"NIO",
  "name": "निकारागुआन कॉर्डोबा",
 },
 {
 "code":"NOK",
  "name": "नॉर्वेजियन क्रोन",
 },
 {
 "code":"NPR",
  "name": "नेपाली रुपया",
 },
 {
 "code":"NZD",
  "name": "न्यूज़ीलैंड डॉलर",
 },
 {
 "code":"OMR",
  "name": "ओमानी रियाल",
 },
 {
 "code":"PAB",
  "name": "पनामेनियन बाल्बोआ",
 },
 {
 "code":"PEN",
  "name": "पेरूवियन सोल",
 },
 {
 "code":"PGK",
  "name": "पापुआ न्यू गिनीयन किना",
 },
 {
 "code":"PHP",
  "name": "फिलीपीन पेसो",
 },
 {
 "code":"PKR",
  "name": "पाकिस्तानी रुपया",
 },
 {
 "code":"PLN",
  "name": "पोलिश ज़्लॉटी",
 },
 {
 "code":"PYG",
  "name": "पैराग्वे गुआरानी",
 },
 {
 "code":"QAR",
  "name": "कतरी रियाल",
 },
 {
 "code":"RON",
  "name": "रोमानियाई ल्यू",
 },
 {
 "code":"RSD",
  "name": "सर्बियाई दीनार",
 },
 {
 "code":"RUB",
  "name": "रूसी रूबल",
 },
 {
 "code":"RWF",
  "name": "रवांडन फ्रैंक",
 },
 {
 "code":"SAR",
  "name": "सऊदी रियाल",
 },
 {
 "code":"SBD",
  "name": "सोलोमन द्वीप डॉलर",
 },
 {
 "code":"SCR",
  "name": "सेशेल्स रुपया",
 },
 {
 "code":"SDG",
  "name": "सूडानी पाउंड",
 },
 {
 "code":"SEK",
  "name": "स्वीडिश क्रोना",
 },
 {
 "code":"SGD",
  "name": "सिंगापुर डॉलर",
 },
 {
 "code":"SHP",
  "name": "सेंट हेलेना पाउंड",
 },
 {
 "code":"SLE",
  "name": "सिएरा लियोनियन लियोन",
 },
 {
 "code":"SOS",
  "name": "सोमाली शिलिंग",
 },
 {
 "code":"SRD",
  "name": "सूरीनामी डॉलर",
 },
 {
 "code":"SSP",
  "name": "दक्षिण सूडानी पाउंड",
 },
 {
 "code":"STN",
  "name": "साओ टोमे और प्रिंसिपे डोबरा",
 },
 {
 "code":"SVC",
  "name": "सल्वाडोरन कॉलन",
 },
 {
 "code":"SYP",
  "name": "सीरियाई पाउंड",
 },
 {
 "code":"SZL",
  "name": "स्वाज़ी लिलांजेनी",
 },
 {
 "code":"THB",
  "name": "थाई बहत",
 },
 {
 "code":"TJS",
  "name": "ताजिकिस्तानी सोमोनी",
 },
 {
 "code":"TMT",
  "name": "तुर्कमेनिस्तान मनात",
 },
 {
 "code":"TND",
  "name": "ट्यूनीशियाई दीनार",
 },
 {
 "code":"TOP",
  "name": "टोंगन पांगा",
 },
 {
 "code":"TRY",
  "name": "तुर्की लीरा",
 },
 {
 "code":"TTD",
  "name": "त्रिनिदाद और टोबैगो डॉलर",
 },
 {
 "code":"TWD",
  "name": "नया ताइवान डॉलर",
 },
 {
 "code":"TZS",
  "name": "तंजानिया शिलिंग",
 },
 {
 "code":"UAH",
  "name": "यूक्रेनी रिव्निया",
 },
 {
 "code":"UGX",
  "name": "युगांडा शिलिंग",
 },
 {
 "code":"USD",
  "name": "संयुक्त राज्य डॉलर",
 },
 {
 "code":"USN",
  "name": "संयुक्त राज्य डॉलर (अगले दिन)",
 },
 {
 "code":"UYI",
  "name": "उरुग्वे पेसो एन यूनिडेड्स इंडेक्साडास (URUIURUI) (फंड कोड)",
 },
 {
 "code":"UYU",
  "name": "उरुग्वे पेसो",
 },
 {
 "code":"UYW",
  "name": "यूनिडाड प्रीविज़नल",
 },
 {
 "code":"UZS",
  "name": "उज़्बेकिस्तानी सोम",
 },
 {
 "code":"VES",
  "name": "वेनेज़ुएला बोलिवर सोबेरानो",
 },
 {
 "code":"VND",
  "name": "वियतनामी डोंग",
 },
 {
 "code":"VUV",
  "name": "वानुअतु वातु",
 },
 {
 "code":"WST",
  "name": "समोआई ताला",
 },
 {
 "code":"XAF",
  "name": "मध्य अफ़्रीकी CFA फ्रैंक",
 },
 {
 "code":"XAG",
  "name": "चांदी (एक ट्रॉय औंस)",
 },
 {
 "code":"XAU",
  "name": "सोना (एक ट्रॉय औंस)",
 },
 {
 "code":"XBA",
  "name": "यूरोपीय समग्र इकाई (EURCO) (बॉन्ड बाजार इकाई)",
 },
 {
 "code":"XBB",
  "name": "यूरोपीय मौद्रिक इकाई (E.M.U.-6) (बॉन्ड बाजार इकाई)",
 },
 {
 "code":"XBC",
  "name": "यूरोपीय खाता इकाई 9 (E.U.A.-9) (बॉन्ड बाजार इकाई)",
 },
 {
 "code":"XBD",
  "name": "यूरोपीय खाता इकाई 17 (E.U.A.-17) (बॉन्ड बाजार इकाई)",
 },
 {
 "code":"XCD",
  "name": "पूर्वी कैरिबियाई डॉलर",
 },
 {
 "code":"XDR",
  "name": "विशेष आहरण अधिकार",
 },
 {
 "code":"XOF",
  "name": "पश्चिम अफ़्रीकी CFA फ्रैंक",
 },
 {
 "code":"XPD",
  "name": "पैलेडियम (एक ट्रॉय औंस)",
 },
 {
 "code":"XPF",
  "name": "CFP फ्रैंक",
 },
 {
 "code":"XPT",
  "name": "प्लैटिनम (एक ट्रॉय औंस)",
 },
 {
 "code":"XSU",
  "name": "सुक्रे",
 },
 {
 "code":"XUA",
  "name": "ADB खाता इकाई",
 },
 {
 "code":"YER",
  "name": "यमनी रियाल",
 },
 {
 "code":"ZAR",
  "name": "दक्षिण अफ़्रीकी रैंड",
 },
 {
 "code":"ZMW",
  "name": "ज़ाम्बियन क्वाचा",
 },
 {
 "code":"ZWL",
  "name": "ज़िम्बाब्वे डॉलर",
 },
];
